app/models/user.rb

  def generate_unique_session_token
    possible_token = SecureRandom::urlsafe_base64
    while User.find_by(session_token: possible_token)
---
SELECT "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]